<?php 
$lang['Build'] = array(
	'Level' => 'سطح',
	'Costs' => 'هزینه ارتقاء به سطح',
	'utomax1' => 'ارتقاء به حداکثر سطح',
	'utomax2' => 'توجه',
	'utomax3' => 'شما طلا کافی ندارید',
	'utomax4' => 'هزینه: '.MAX_LEVEL_COST.' طلا',
    'Level' => 'سطح',
    'Train' => 'آموزش',
    'Overview' => 'نمای کلی',
    
    'Train01' => 'نیروها',
    'Train02' => 'زمان',
    'Train03' => 'پایان',

    'on' => 'در',
    'at' => 'در',

    'build36' => 'تله‌ساز',
    'build36d' => 'تله‌هایی برای محافظت از گندم شما که برای به دام انداختن مهاجمان طراحی شده‌اند. در هر سطح تعداد Z تله در دسترس است.',
    'build36_01' => 'تعداد کل تله‌ها',
    'build36_02' => 'تعداد H تله‌ها',
    'build36_03' => 'تعداد تله‌ها در سطح T',
    'build36_04' => 'شما <b>%s</b> تله دارید. <b>%s</b> از آن‌ها پر شده است',
    'build36_05' => 'تعداد کل تله‌ها',
    'build36_06' => 'تله',

    'Complete01' => 'دستورات زیر فوراً تکمیل خواهند شد',
    'Complete02' => 'ساختمان‌ها',
    'Complete03' => 'بازخرید',
    
    'Available01' => 'زیرساخت‌ها',
    'Available02' => 'نظامی',
    'Available03' => 'منابع',

    'Market01' => 'بازرگانان شما و NPC',
    'Market02' => 'بازرگانان آزاد',
    'Market03' => 'بازرگانان حامل منابع',
    'Market04' => 'بازرگانان در حال حرکت',
    'Market05' => 'منابع دهکده خود را فوراً با بازرگان NPC با نسبت ۱:۱ مبادله کنید.',
    'Market06' => 'تبادل منابع',

    'Exchange01' => 'با بازرگان NPC می‌توانید منابع موجود در انبار خود را هرطور که می‌خواهید توزیع کنید.',
    'Exchange02' => 'خط اول موجودی فعلی را نشان می‌دهد. در خط دوم می‌توانید توزیع دیگری انتخاب کنید. خط سوم تفاوت بین موجودی قبلی و جدید را نشان می‌دهد.',
    'Exchange03' => 'باقی‌مانده',
    'Exchange04' => 'مجموع',
    'Exchange05' => 'منابع باقی‌مانده را توزیع کنید.',
    'Exchange06' => 'اکنون بازخرید کنید',
);
