<?php
$lang['News'] = array(
    '1' => 'حساب پلاس در',
    '2' => 'پاداش تولید چوب در',
    '3' => 'پاداش تولید خاک رس در',
    '4' => 'پاداش تولید آهن در',
    '5' => 'پاداش تولید گندم در',

    '1F' => 'حساب پلاس شما منقضی شده است.',
    '2F' => 'پاداش تولید چوب منقضی شده است.',
    '3F' => 'پاداش تولید خاک رس منقضی شده است.',
    '4F' => 'پاداش تولید آهن منقضی شده است.',
    '5F' => 'پاداش تولید گندم منقضی شده است.',

    'Button01' => 'تمدید اکنون',
    'Button02' => 'مدت زمان پاداش بر حسب ساعت',
    'Button03' => 'ساعت',
    'Button04' => 'تمدید',

    'Hour' => 'ساعت',

    'Arts' => 'آرتیفکت‌ها در %s ساعت دیگر آزاد خواهند شد.',
    'WWPlans' => 'نقشه‌های ساخت در %s ساعت دیگر ظاهر خواهند شد.',
);
