<?php 
$lang['Register'] = array(
    '00' => 'قبیله خود را انتخاب کنید',
    '01' => 'امپراتوری‌های بزرگ با تصمیمات مهم آغاز می‌شوند! آیا شما یک مهاجم عاشق رقابت هستید؟ یا زمان محدودی دارید؟ آیا یک بازیکن تیمی هستید که از ساختن اقتصادی قدرتمند برای شکل‌دادن به سندان لذت می‌برید؟',
    
    '02' => 'گول‌ها',
    '03' => 'نیاز کم به زمان',
    '04' => 'محافظت در برابر غارت و دفاع خوب',
    '05' => 'سواره‌نظام بسیار سریع و عالی',
    '06' => 'بسیار مناسب برای بازیکنان جدید',

    '07' => 'رومی‌ها',
    '08' => 'نیاز متوسط به زمان',
    '09' => 'سریع‌ترین توسعه دهکده‌ها',
    '10' => 'نیروهای بسیار قدرتمند اما گران',
    '11' => 'سخت برای بازیکنان تازه‌کار',

    '12' => 'توتون‌ها',
    '13' => 'نیاز بالا به زمان',
    '14' => 'عالی برای غارت در ابتدای بازی',
    '15' => 'پیاده‌نظام قوی و ارزان',
    '16' => 'برای بازیکنان تهاجمی',

    '17' => 'مصری‌ها',
    '18' => 'نیاز کم به زمان',
    '19' => 'منابع بیشتر در دسترس',
    '20' => 'واحدهای دفاعی فوق‌العاده',
    '21' => 'مناسب برای بازیکنان تازه‌کار',

    '22' => 'هون‌ها',
    '23' => 'نیاز بالا به زمان',
    '24' => 'سواره‌نظام فوق‌العاده قدرتمند',
    '25' => 'وابسته به دیگران برای محافظت',
    '26' => 'برای بازیکنان تازه‌کار توصیه نمی‌شود!',

    '27' => 'موقعیت شروع خود را انتخاب کنید',
    '28' => 'می‌خواهید از کجا ساخت امپراتوری خود را آغاز کنید؟ از منطقه "توصیه‌شده" برای بهترین موقعیت استفاده کنید. یا منطقه‌ای که دوستانتان حضور دارند انتخاب کنید و تیم تشکیل دهید!',
    '29' => 'شمال - شرق',
    '30' => 'شمال - غرب',
    '31' => 'جنوب - شرق',
    '32' => 'جنوب - غرب',

    '33' => 'آماده‌ی حکومت بر جهان هستید؟',
    '34' => 'انتخاب شما تکمیل شد. تنها یک کلیک تا پذیرفتن چالش باقی مانده!',

    'PlayNow' => 'شروع بازی',
    'SRECOMMENDED' => 'توصیه‌شده',
    'Recommended' => 'توصیه‌شده برای بازیکنان جدید',
    'Confirm' => 'تأیید',
);
