<?php
if(!defined("HLXGUVENLIK"))
	exit('OLDU');
$itemler=[
    1=>["type"=>1,"item"=>"کلاه خود آگاهی","aciklama"=>"+%15 تجربه بیشتر"],
    2=>["type"=>1,"item"=>"کلاه خود روشنایی","aciklama"=>"+%20 تجربه بیشتر"],
    3=>["type"=>1,"item"=>"کلاه خود حکمت","aciklama"=>"+%25 تجربه بیشتر"],
    4=>["type"=>1,"item"=>"کلاه خود بازسازی","aciklama"=>"+10 واحد سلامتی در روز"],
    5=>["type"=>1,"item"=>"کلاه خود سلامتی","aciklama"=>"+15 واحد سلامتی در روز"],
    6=>["type"=>1,"item"=>"کلاه خود شفا","aciklama"=>"+20 واحد سلامتی در روز"],
    7=>["type"=>1,"item"=>"کلاه خود گلادیاتور","aciklama"=>"+100 امتیاز فرهنگی در روز"],
    8=>["type"=>1,"item"=>"کلاه خود تریبون","aciklama"=>"+400 امتیاز فرهنگی در روز"],
    9=>["type"=>1,"item"=>"کلاه خود کنسول","aciklama"=>"+800 امتیاز فرهنگی در روز"],
    10=>["type"=>1,"item"=>"کلاه خود سواره‌نظام","aciklama"=>"کاهش 10٪ زمان آموزش در حالت پایدار"],
    11=>["type"=>1,"item"=>"کلاه خود سواره‌نظام پیشرفته","aciklama"=>"کاهش 15٪ زمان آموزش در حالت پایدار"],
    12=>["type"=>1,"item"=>"کلاه خود سواره‌نظام سنگین","aciklama"=>"کاهش 20٪ زمان آموزش در حالت پایدار"],
    13=>["type"=>1,"item"=>"کلاه خود مزدور","aciklama"=>"کاهش 10٪ زمان آموزش در سربازخانه"],
    14=>["type"=>1,"item"=>"کلاه خود جنگجو","aciklama"=>"کاهش 15٪ زمان آموزش در سربازخانه"],
    15=>["type"=>1,"item"=>"کلاه خود آرخون","aciklama"=>"کاهش 20٪ زمان آموزش در سربازخانه"],
    82=>["type"=>2,"item"=>"زره بازسازی","aciklama"=>"+20 سلامتی روزانه"],
    83=>["type"=>2,"item"=>"زره سلامتی","aciklama"=>"+30 سلامتی روزانه"],
    84=>["type"=>2,"item"=>"زره شفا","aciklama"=>"+40 سلامتی روزانه"],
    85=>["type"=>2,"item"=>"زره سبک فلس","aciklama"=>"کاهش 4 آسیب + 10 سلامتی بازسازی"],
    86=>["type"=>2,"item"=>"زره فلس","aciklama"=>"کاهش 6 آسیب + 15 سلامتی بازسازی"],
    87=>["type"=>2,"item"=>"زره سنگین فلس","aciklama"=>"کاهش 8 آسیب + 20 سلامتی بازسازی"],
    88=>["type"=>2,"item"=>"زره سینه سبک","aciklama"=>"+500 قدرت جنگی برای قهرمان"],
    89=>["type"=>2,"item"=>"زره سینه","aciklama"=>"+1000 قدرت جنگی برای قهرمان"],
    90=>["type"=>2,"item"=>"زره سینه سنگین","aciklama"=>"+1500 قدرت جنگی برای قهرمان"],
    91=>["type"=>2,"item"=>"زره قطعه‌ای سبک","aciklama"=>"کاهش 3 آسیب + 250 قدرت جنگی قهرمان"],
    92=>["type"=>2,"item"=>"زره قطعه‌ای","aciklama"=>"کاهش 4 آسیب + 500 قدرت جنگی قهرمان"],
    93=>["type"=>2,"item"=>"زره قطعه‌ای سنگین","aciklama"=>"کاهش 5 آسیب + 750 قدرت جنگی قهرمان"],
    61=>["type"=>3,"item"=>"نقشه کوچک","aciklama"=>"30٪ بازگشت سریع‌تر"],
    62=>["type"=>3,"item"=>"نقشه","aciklama"=>"40٪ بازگشت سریع‌تر"],
    63=>["type"=>3,"item"=>"نقشه بزرگ","aciklama"=>"50٪ بازگشت سریع‌تر"],
    64=>["type"=>3,"item"=>"پرچم کوچک","aciklama"=>"30٪ سرعت بیشتر جابه‌جایی نیرو بین روستاهای خودی"],
    65=>["type"=>3,"item"=>"پرچم","aciklama"=>"40٪ سرعت بیشتر جابه‌جایی نیرو بین روستاهای خودی"],
    66=>["type"=>3,"item"=>"پرچم بزرگ","aciklama"=>"50٪ سرعت بیشتر جابه‌جایی نیرو بین روستاهای خودی"],
    67=>["type"=>3,"item"=>"استاندارد کوچک","aciklama"=>"15٪ سرعت بیشتر بین اعضای اتحاد"],
    68=>["type"=>3,"item"=>"استاندارد","aciklama"=>"20٪ سرعت بیشتر بین اعضای اتحاد"],
    69=>["type"=>3,"item"=>"استاندارد بزرگ","aciklama"=>"25٪ سرعت بیشتر بین اعضای اتحاد"],
    73=>["type"=>3,"item"=>"کیسه دزد","aciklama"=>"+10٪ غنیمت بیشتر"],
    74=>["type"=>3,"item"=>"کیف دزد","aciklama"=>"+15٪ غنیمت بیشتر"],
    75=>["type"=>3,"item"=>"خورجین دزد","aciklama"=>"+20٪ غنیمت بیشتر"],
    76=>["type"=>3,"item"=>"سپر کوچک","aciklama"=>"+500 قدرت قهرمان"],
    77=>["type"=>3,"item"=>"سپر","aciklama"=>"+1000 قدرت قهرمان"],
    78=>["type"=>3,"item"=>"سپر بزرگ","aciklama"=>"+1500 قدرت قهرمان"],
    79=>["type"=>3,"item"=>"شاخ کوچک ناتار","aciklama"=>"+20٪ قدرت جنگی علیه ناتارها"],
    80=>["type"=>3,"item"=>"شاخ ناتار","aciklama"=>"+25٪ قدرت جنگی علیه ناتارها"],
    81=>["type"=>3,"item"=>"شاخ بزرگ ناتار","aciklama"=>"+30٪ قدرت جنگی علیه ناتارها"],
        16=>["type"=>4,"item"=>"شمشیر کوتاه لژیونر","aciklama"=>"+500 قدرت قهرمان؛ برای هر لژیونر: +3 حمله و +3 دفاع"],
    17=>["type"=>4,"item"=>"شمشیر لژیونر","aciklama"=>"+1000 قدرت قهرمان؛ برای هر لژیونر: +4 حمله و +4 دفاع"],
    18=>["type"=>4,"item"=>"شمشیر بلند لژیونر","aciklama"=>"+1500 قدرت قهرمان؛ برای هر لژیونر: +5 حمله و +5 دفاع"],
    19=>["type"=>4,"item"=>"شمشیر کوتاه پرتوریان","aciklama"=>"+500 قدرت قهرمان؛ برای هر پرتوریان: +3 حمله و +3 دفاع"],
    20=>["type"=>4,"item"=>"شمشیر پرتوریان","aciklama"=>"+1000 قدرت قهرمان؛ برای هر پرتوریان: +4 حمله و +4 دفاع"],
    21=>["type"=>4,"item"=>"شمشیر بلند پرتوریان","aciklama"=>"+1500 قدرت قهرمان؛ برای هر پرتوریان: +5 حمله و +5 دفاع"],
    22=>["type"=>4,"item"=>"شمشیر کوتاه ایمپریان","aciklama"=>"+500 قدرت قهرمان؛ برای هر ایمپریان: +3 حمله و +3 دفاع"],
    23=>["type"=>4,"item"=>"شمشیر ایمپریان","aciklama"=>"+1000 قدرت قهرمان؛ برای هر ایمپریان: +4 حمله و +4 دفاع"],
    24=>["type"=>4,"item"=>"شمشیر بلند ایمپریان","aciklama"=>"+1500 قدرت قهرمان؛ برای هر ایمپریان: +5 حمله و +5 دفاع"],
    25=>["type"=>4,"item"=>"شمشیر کوتاه ایمپراتوریس","aciklama"=>"+500 قدرت قهرمان؛ برای هر Equites Imperatoris: +9 حمله و +9 دفاع"],
    26=>["type"=>4,"item"=>"شمشیر ایمپراتوریس","aciklama"=>"+1000 قدرت قهرمان؛ برای هر Equites Imperatoris: +12 حمله و +12 دفاع"],
    27=>["type"=>4,"item"=>"شمشیر بلند ایمپراتوریس","aciklama"=>"+1500 قدرت قهرمان؛ برای هر Equites Imperatoris: +15 حمله و +15 دفاع"],
    28=>["type"=>4,"item"=>"نیزه سبک قیصریان","aciklama"=>"+500 قدرت قهرمان؛ برای هر Equites Caesaris: +12 حمله و +12 دفاع"],
    29=>["type"=>4,"item"=>"نیزه قیصریان","aciklama"=>"+1000 قدرت قهرمان؛ برای هر Equites Caesaris: +16 حمله و +16 دفاع"],
    30=>["type"=>4,"item"=>"نیزه سنگین قیصریان","aciklama"=>"+1500 قدرت قهرمان؛ برای هر Equites Caesaris: +20 حمله و +20 دفاع"],
    31=>["type"=>4,"item"=>"نیزه فالانکس","aciklama"=>"+500 قدرت قهرمان؛ برای هر فالانکس: +3 حمله و +3 دفاع"],
    32=>["type"=>4,"item"=>"نیزه فالانکس","aciklama"=>"+1000 قدرت قهرمان؛ برای هر فالانکس: +4 حمله و +4 دفاع"],
    33=>["type"=>4,"item"=>"نیزه بلند فالانکس","aciklama"=>"+1500 قدرت قهرمان؛ برای هر فالانکس: +5 حمله و +5 دفاع"],
    34=>["type"=>4,"item"=>"شمشیر کوتاه شمشیرزن","aciklama"=>"+500 قدرت قهرمان؛ برای هر شمشیرزن: +3 حمله و +3 دفاع"],
    35=>["type"=>4,"item"=>"شمشیر شمشیرزن","aciklama"=>"+1000 قدرت قهرمان؛ برای هر شمشیرزن: +4 حمله و +4 دفاع"],
    36=>["type"=>4,"item"=>"شمشیر بلند شمشیرزن","aciklama"=>"+1500 قدرت قهرمان؛ برای هر شمشیرزن: +5 حمله و +5 دفاع"],
    37=>["type"=>4,"item"=>"کمان کوتاه توتاتس","aciklama"=>"+500 قدرت قهرمان؛ برای هر Theutates Thunder: +6 حمله و +6 دفاع"],
    38=>["type"=>4,"item"=>"کمان توتاتس","aciklama"=>"+1000 قدرت قهرمان؛ برای هر Theutates Thunder: +8 حمله و +8 دفاع"],
    39=>["type"=>4,"item"=>"کمان بلند توتاتس","aciklama"=>"+1500 قدرت قهرمان؛ برای هر Theutates Thunder: +10 حمله و +10 دفاع"],
    40=>["type"=>4,"item"=>"عصای درویدرایدر","aciklama"=>"+500 قدرت قهرمان؛ برای هر Druidrider: +6 حمله و +6 دفاع"],
    41=>["type"=>4,"item"=>"عصای بزرگ درویدرایدر","aciklama"=>"+1000 قدرت قهرمان؛ برای هر Druidrider: +8 حمله و +8 دفاع"],
    42=>["type"=>4,"item"=>"عصای جنگی درویدرایدر","aciklama"=>"+1500 قدرت قهرمان؛ برای هر Druidrider: +10 حمله و +10 دفاع"],
    43=>["type"=>4,"item"=>"نیزه سبک هیدوان","aciklama"=>"+500 قدرت قهرمان؛ برای هر Haeduan: +9 حمله و +9 دفاع"],
    44=>["type"=>4,"item"=>"نیزه هیدوان","aciklama"=>"+1000 قدرت قهرمان؛ برای هر Haeduan: +12 حمله و +12 دفاع"],
    45=>["type"=>4,"item"=>"نیزه سنگین هیدوان","aciklama"=>"+1500 قدرت قهرمان؛ برای هر Haeduan: +15 حمله و +15 دفاع"],
    46=>["type"=>4,"item"=>"چماق کلاب‌سوینگر","aciklama"=>"+500 قدرت قهرمان؛ برای هر گرزدار: +3 حمله و +3 دفاع"],
    47=>["type"=>4,"item"=>"گرز جنگی","aciklama"=>"+1000 قدرت قهرمان؛ برای هر گرزدار: +4 حمله و +4 دفاع"],
    48=>["type"=>4,"item"=>"ستاره صبح کلاب‌سوینگر","aciklama"=>"+1500 قدرت قهرمان؛ برای هر گرزدار: +5 حمله و +5 دفاع"],
    49=>["type"=>4,"item"=>"نیزه نیزه‌دار","aciklama"=>"+500 قدرت قهرمان؛ برای هر نیزه‌دار: +3 حمله و +3 دفاع"],
    50=>["type"=>4,"item"=>"نیزه بلند نیزه‌دار","aciklama"=>"+1000 قدرت قهرمان؛ برای هر نیزه‌دار: +4 حمله و +4 دفاع"],
    51=>["type"=>4,"item"=>"نیزه سنگین نیزه‌دار","aciklama"=>"+1500 قدرت قهرمان؛ برای هر نیزه‌دار: +5 حمله و +5 دفاع"],
    52=>["type"=>4,"item"=>"تبر تبرزن","aciklama"=>"+500 قدرت قهرمان؛ برای هر Axeman: +3 حمله و +3 دفاع"],
    53=>["type"=>4,"item"=>"تبر جنگی","aciklama"=>"+1000 قدرت قهرمان؛ برای هر Axeman: +4 حمله و +4 دفاع"],
    54=>["type"=>4,"item"=>"تبر نبرد","aciklama"=>"+1500 قدرت قهرمان؛ برای هر Axeman: +5 حمله و +5 دفاع"],
    55=>["type"=>4,"item"=>"چکش سبک پالادین","aciklama"=>"+500 قدرت قهرمان؛ برای هر پالادین: +6 حمله و +6 دفاع"],
    56=>["type"=>4,"item"=>"چکش پالادین","aciklama"=>"+1000 قدرت قهرمان؛ برای هر پالادین: +8 حمله و +8 دفاع"],
    57=>["type"=>4,"item"=>"چکش سنگین پالادین","aciklama"=>"+1500 قدرت قهرمان؛ برای هر پالادین: +10 حمله و +10 دفاع"],
    58=>["type"=>4,"item"=>"شمشیر کوتاه شوالیه ژرمن","aciklama"=>"+500 قدرت قهرمان؛ برای هر شوالیه توتونی: +9 حمله و +9 دفاع"],
    59=>["type"=>4,"item"=>"شمشیر شوالیه ژرمن","aciklama"=>"+1000 قدرت قهرمان؛ برای هر شوالیه توتونی: +12 حمله و +12 دفاع"],
    60=>["type"=>4,"item"=>"شمشیر بلند شوالیه ژرمن","aciklama"=>"+1500 قدرت قهرمان؛ برای هر شوالیه توتونی: +15 حمله و +15 دفاع"],
    94=>["type"=>5,"item"=>"چکمه‌های سبک","aciklama"=>"سرعت قهرمان +3"],
    95=>["type"=>5,"item"=>"چکمه‌ها","aciklama"=>"سرعت قهرمان +4"],
    96=>["type"=>5,"item"=>"چکمه‌های سنگین","aciklama"=>"سرعت قهرمان +5"],
    97=>["type"=>5,"item"=>"چکمه‌های مرکب","aciklama"=>"سرعت قهرمان +3 و +25٪ سرعت بازگشت"],
    98=>["type"=>5,"item"=>"چکمه‌های تقویت‌شده","aciklama"=>"سرعت قهرمان +4 و +30٪ سرعت بازگشت"],
    99=>["type"=>5,"item"=>"چکمه‌های پیشرفته","aciklama"=>"سرعت قهرمان +5 و +35٪ سرعت بازگشت"],
    100=>["type"=>5,"item"=>"چکمه‌های مزدور","aciklama"=>"سرعت قهرمان +3 و +20 ظرفیت حمل"],
    101=>["type"=>5,"item"=>"چکمه‌های جنگجو","aciklama"=>"سرعت قهرمان +4 و +25 ظرفیت حمل"],
    102=>["type"=>5,"item"=>"چکمه‌های آرخون","aciklama"=>"سرعت قهرمان +5 و +30 ظرفیت حمل"],

    103=>["type"=>6,"item"=>"اسب کوچک","aciklama"=>"سرعت قهرمان 14"],
    104=>["type"=>6,"item"=>"اسب","aciklama"=>"سرعت قهرمان 17"],
    105=>["type"=>6,"item"=>"اسب جنگی","aciklama"=>"سرعت قهرمان 20"],

    106=>["type"=>7,"item"=>"باند کوچک","aciklama"=>"+25٪ سرعت بازسازی سلامتی"],
    107=>["type"=>7,"item"=>"باند","aciklama"=>"+33٪ سرعت بازسازی سلامتی"],
    108=>["type"=>7,"item"=>"باند بزرگ","aciklama"=>"+50٪ سرعت بازسازی سلامتی"],

    109=>["type"=>8,"item"=>"کتاب کوچک حکمت","aciklama"=>"امکان توزیع دوباره امتیازهای قهرمان"],
    110=>["type"=>8,"item"=>"کتاب حکمت","aciklama"=>"امکان توزیع دوباره امتیازهای قهرمان"],
    
    111=>["type"=>9,"item"=>"اثر هنری","aciklama"=>"به اندازه تولید روزانه امتیاز فرهنگی به صورت فوری می‌دهد (حداکثر 5000)"],
    
    112=>["type"=>10,"item"=>"پماد","aciklama"=>"سلامتی قهرمان را 1٪ بازیابی می‌کند"],
    113=>["type"=>10,"item"=>"مرهم","aciklama"=>"سلامتی قهرمان را 10٪ بازیابی می‌کند"],
    114=>["type"=>10,"item"=>"داروی شفا","aciklama"=>"سلامتی قهرمان را 25٪ بازیابی می‌کند"],
    115=>["type"=>10,"item"=>"اکسیر زندگی","aciklama"=>"سلامتی قهرمان را کاملاً بازیابی می‌کند"],

    116=>["type"=>11,"item"=>"قفس کوچک","aciklama"=>"می‌تواند حیوانات واحه را اسیر کند"],
    117=>["type"=>11,"item"=>"قفس","aciklama"=>"می‌تواند حیوانات واحه را اسیر کند"],
    118=>["type"=>11,"item"=>"قفس بزرگ","aciklama"=>"می‌تواند حیوانات واحه را اسیر کند"],

    119=>["type"=>12,"item"=>"کیسه منابع کوچک","aciklama"=>"حاوی مقدار کمی منابع"],
    120=>["type"=>12,"item"=>"کیسه منابع","aciklama"=>"حاوی مقدار متوسطی از منابع"],
    121=>["type"=>12,"item"=>"کیسه منابع بزرگ","aciklama"=>"حاوی مقدار زیادی منابع"],

    122=>["type"=>13,"item"=>"جعبه نقره کوچک","aciklama"=>"مقدار کمی نقره می‌دهد"],
    123=>["type"=>13,"item"=>"جعبه نقره","aciklama"=>"مقدار متوسطی نقره می‌دهد"],
    124=>["type"=>13,"item"=>"جعبه نقره بزرگ","aciklama"=>"مقدار زیادی نقره می‌دهد"],

    125=>["type"=>14,"item"=>"بسته کوچک سرباز","aciklama"=>"چند واحد نظامی می‌دهد"],
    126=>["type"=>14,"item"=>"بسته سرباز","aciklama"=>"تعداد متوسطی واحد نظامی می‌دهد"],
    127=>["type"=>14,"item"=>"بسته بزرگ سرباز","aciklama"=>"تعداد زیادی واحد نظامی می‌دهد"],

    128=>["type"=>15,"item"=>"بسته کوچک منابع","aciklama"=>"مقدار کمی منابع می‌دهد"],
    129=>["type"=>15,"item"=>"بسته منابع","aciklama"=>"مقدار متوسطی منابع می‌دهد"],
    130=>["type"=>15,"item"=>"بسته بزرگ منابع","aciklama"=>"مقدار زیادی منابع می‌دهد"],

    131=>["type"=>16,"item"=>"کمان کوتاه","aciklama"=>"+500 قدرت قهرمان"],
    132=>["type"=>16,"item"=>"کمان","aciklama"=>"+1000 قدرت قهرمان"],
    133=>["type"=>16,"item"=>"کمان بلند","aciklama"=>"+1500 قدرت قهرمان"],

    134=>["type"=>17,"item"=>"شمشیر اسپاتای کوتاه","aciklama"=>"+500 قدرت قهرمان"],
    135=>["type"=>17,"item"=>"شمشیر اسپاتا","aciklama"=>"+1000 قدرت قهرمان"],
    136=>["type"=>17,"item"=>"شمشیر اسپاتای بلند","aciklama"=>"+1500 قدرت قهرمان"],

    137=>["type"=>18,"item"=>"کمان سبک","aciklama"=>"+500 قدرت قهرمان"],
    138=>["type"=>18,"item"=>"کمان تقویت‌شده","aciklama"=>"+1000 قدرت قهرمان"],
    139=>["type"=>18,"item"=>"کمان جنگی","aciklama"=>"+1500 قدرت قهرمان"],

    140=>["type"=>19,"item"=>"شمشیر کوتاه","aciklama"=>"+500 قدرت قهرمان"],
    141=>["type"=>19,"item"=>"شمشیر","aciklama"=>"+1000 قدرت قهرمان"],
    142=>["type"=>19,"item"=>"شمشیر بلند","aciklama"=>"+1500 قدرت قهرمان"],

    143=>["type"=>20,"item"=>"شمشیر کوتاه اسپاتا","aciklama"=>"+500 قدرت قهرمان"],
    144=>["type"=>20,"item"=>"شمشیر اسپاتای بزرگ","aciklama"=>"+1500 قدرت قهرمان"],
];


if(isset($_POST['acikArtirma'])){
    if(isset($itemler[$_POST['itemid']])){
        try{
            $item=$itemler[$_POST['itemid']];
            for($i=0;$i<$_POST['ekSay'];$i++){
                $database->query("INSERT INTO auction (`owner`, `itemid`, `btype`, `type`, `num`, `uid`, `bids`, `silver`, `newsilver`, `time`, `finish`) VALUES ('".$_POST['owner']."', '".(time()+$i)."', '".$item['type']."', '".$_POST['itemid']."', '".$_POST['num']."', 0, 0, '".$_POST['silver']."', 0, '".(time()+($_POST['sure']*60))."', 0)");
            }
            echo 'آیتم‌های حراجی اضافه شدند.';
        }catch(Exception $e){
            echo 'HATA : '.$e->getMessage();
        }
    }else{
        echo ' آیتمی یافت نشد!';
    }

}
$kullanicilar=$database->query('SELECT id,username FROM users');
?>
<form action="" method="post">
	<div class="form-group">
		<label>İTEM</label>
		<select class="custom-select mr-sm-2" name="itemid" required>
            <?php
                foreach($itemler as $k=>$v){
                    echo '<option value="'.$k.'">'.$v["item"].'-'.$v["aciklama"].'</option>';
                }
            ?>
		</select>
	</div>
	<div class="form-group">
		<label>قیمت حراجی</label>
		<input type="number" step="1" name="silver" class="form-control" placeholder="100" required>
	</div>
	<div class="form-group">
		<label>تعداد</label>
		<input type="number" step="1" name="ekSay" class="form-control" placeholder="5" required>
	</div>
	<div class="form-group">
		<label>مقدار</label>
		<input type="number" step="1" name="num" class="form-control" placeholder="5" required>
	</div>
	<div class="form-group">
		<label>مدت به دقیقه</label>
		<input type="number" step="1" name="sure" class="form-control" placeholder="5" required>
	</div>
	<div class="form-group">
		<label>کاربر</label>
		<select class="custom-select mr-sm-2" name="owner" required>
			<?php
				foreach($kullanicilar as $kullanici){
					echo '<option value="'.$kullanici['id'].'">'.$kullanici['username'].'</option>';
				}
			?>
		</select>
	</div>
	<div class="form-group text-center">
		<input type="submit" class="btn btn-primary" name="acikArtirma" value="Açık Artırma Ekle">
	</div>
</form>