<?php 
$lang['login'] = array(
    'Welcome' => 'به سرور خوش آمدید',
    'Username' => 'نام کاربری یا آدرس ایمیل',
    'Password' => 'رمز عبور',

    'Notice1' => 'نسخه مخصوص بازیکنان',
    'Notice2' => 'با پهنای باند کم (سرعت اینترنت پایین)',
    'Notice3' => '(توجه: در این نسخه از نقشه تمام امکانات فعال نیستند)',

    'Login' => 'ورود',

    'ForgetPW1' => 'رمز عبور را فراموش کرده‌اید؟',
    'ForgetPW2' => 'ما برای شما یک رمز عبور جدید ارسال خواهیم کرد. این رمز به محض اینکه دریافت آن را تأیید کنید فعال خواهد شد.',
    'ForgetPW3' => 'ایمیل',
    'ForgetPW4' => 'درخواست رمز عبور',
);
