<?php 
$lang['Support'] = array(
    '01' => 'پشتیبانی',
    '02' => 'شما می‌توانید از فرم زیر برای ارسال درخواست خود به بخش پشتیبانی استفاده کنید. لطفاً کمی وقت بگذارید و سوالات فرم را با حداکثر جزئیات پاسخ دهید تا ما بتوانیم درخواست شما را با سرعت و دقت بیشتری بررسی کنیم. توجه داشته باشید که بدون وارد کردن یک آدرس ایمیل معتبر، به درخواست شما رسیدگی نخواهد شد.',
    '03' => 'خطاهای بازی، مشکلات ورود و سوالات مربوط به قوانین بازی',
    '04' => 'دنیای بازی',
    '05' => 'نام کاربری',
    '06' => 'ایمیل',
    '07' => 'دسته‌بندی',
    '08' => 'متن پیام',
    '09' => 'کد امنیتی',
    '10' => 'ارسال درخواست',
);
